## Plan output

```
module.microservice.module.database.module.database.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.microservice.module.worker.data.aws_partition.current: Reading...
module.hosted_zones.aws_route53_query_log.this["document_transfer"]: Refreshing state... [id=fe638ff4-a024-4c13-9df3-3ea796f5fd31]
module.hosted_zones.aws_cloudwatch_log_resource_policy.this["document_transfer"]: Refreshing state... [id=illinois-getchildcare-staging-route53-staging.document-transfer.cfa.codes]
module.vpc.data.aws_availability_zones.available: Reading...
module.microservice.module.worker.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:cluster/illinois-getchildcare-staging-doc-transfer-worker]
module.hosted_zones.module.hosted_zones.aws_route53_zone.this["document_transfer"]: Refreshing state... [id=Z02064831UC6N7D03DSNG]
module.microservice.module.service.aws_iam_role.execution: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-execution]
module.microservice.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.secrets.data.aws_partition.current: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.microservice.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.bastion.data.aws_region.current: Reading...
module.bastion.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.otel_config.aws_ssm_parameter.this[0]: Refreshing state... [id=/illinois-getchildcare/staging/document-transfer/otel]
module.logging.module.s3.aws_s3_bucket.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Read complete after 1s [id=Z02064831UC6N7D03DSNG]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 1s [id=o-f5mr0gq6lc]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.bastion.data.aws_caller_identity.identity: Reading...
module.microservice.module.worker.module.otel_config.aws_ssm_parameter.this[0]: Refreshing state... [id=/illinois-getchildcare/staging/doc-transfer-worker/otel]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.microservice.module.service.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:891377151751:certificate/8ac88d33-64f4-45c5-bc82-610cf16b1a70]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.microservice.module.worker.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.microservice.module.service.aws_iam_role.task: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-task]
module.bastion.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.secrets.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.microservice.module.service.data.aws_partition.current: Reading...
module.microservice.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.microservice.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.data.aws_lambda_functions.all: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.logging.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.worker.aws_iam_role.task: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker-task]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.logging.data.aws_lambda_functions.all: Reading...
module.microservice.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.database.data.aws_partition.current: Reading...
module.microservice.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.bastion.data.aws_ami.bastion: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.microservice.module.service.data.aws_region.current: Reading...
module.microservice.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_partition.current: Reading...
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.microservice.module.worker.data.aws_region.current: Reading...
module.microservice.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.secrets.data.aws_region.current: Reading...
module.microservice.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.backend.aws_s3_bucket.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.microservice.module.service.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:cluster/illinois-getchildcare-staging-document-transfer]
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.microservice.module.service.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_caller_identity.identity: Reading...
module.microservice.module.worker.aws_iam_role.execution: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker-execution]
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.backend.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c4c542a315b431d2]
module.logging.module.s3.data.aws_region.current: Reading...
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.database.data.aws_caller_identity.identity: Reading...
module.bastion.data.aws_partition.current: Reading...
module.bastion.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.data.aws_region.current: Reading...
module.microservice.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.worker.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.data.aws_lambda_functions.all: Read complete after 1s [id=us-east-1]
module.microservice.module.database.module.database.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20240719181814988100000001]
module.backend.data.aws_caller_identity.identity: Read complete after 1s [id=891377151751]
module.microservice.module.worker.aws_kms_key.fargate: Refreshing state... [id=2c1ab5d7-6ad2-45d3-854f-52b71401de48]
module.microservice.module.database.data.aws_caller_identity.identity: Read complete after 1s [id=891377151751]
module.microservice.module.secrets.aws_kms_key.secrets: Refreshing state... [id=2a8b7a60-70dc-4812-b0c2-ea121056ef55]
module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002]
module.microservice.module.service.aws_kms_key.fargate: Refreshing state... [id=d654dd34-e8d2-4218-ab18-512c5c6bcee4]
module.microservice.module.service.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.aws_route53_record.endpoint_validation["staging.document-transfer.cfa.codes"]: Refreshing state... [id=Z02064831UC6N7D03DSNG__1614a409f9459d5606d9aec8c0d3cee6.staging.document-transfer.cfa.codes._CNAME]
module.bastion.data.aws_ami.bastion: Read complete after 1s [id=ami-00a929b66ed6e0de6]
module.bastion.aws_kms_key.this: Refreshing state... [id=aa8437fc-f46d-49ac-99a2-1c0b0bbddfd6]
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.microservice.module.database.aws_kms_key.database: Refreshing state... [id=c44eda7e-7b5d-43b1-977e-f4d7e580e0db]
module.logging.module.s3.aws_s3_bucket_server_side_encryption_configuration.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=2435597572]
module.logging.module.s3.aws_s3_bucket_ownership_controls.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_public_access_block.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.module.s3.aws_s3_bucket_versioning.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.microservice.data.aws_lambda_function.datadog["this"]: Reading...
module.microservice.module.database.module.database.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20240719181814988100000001-20240719181815513000000003]
module.logging.aws_s3_bucket_object_lock_configuration.lock["this"]: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.aws_kms_key.logs: Refreshing state... [id=c9834240-1993-4623-9c60-ab21bd6a7269]
module.microservice.module.service.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2024-05-20 16:37:42.638 +0000 UTC]
module.microservice.module.worker.aws_kms_alias.fargate: Refreshing state... [id=alias/illinois-getchildcare/staging/doc-transfer-worker]
module.microservice.module.secrets.aws_kms_alias.secrets: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/secrets]
module.microservice.module.service.aws_kms_alias.fargate: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer]
module.bastion.aws_kms_alias.this: Refreshing state... [id=alias/illinois-getchildcare/staging/bastion]
module.microservice.module.database.aws_kms_alias.database: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/database]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=1133955049]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.logging.module.s3.aws_s3_bucket_policy.main: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8]
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h]
module.logging.aws_kms_alias.logs: Refreshing state... [id=alias/illinois-getchildcare/staging/logs]
module.logging.aws_cloudwatch_log_group.logs["document-transfer-dns"]: Refreshing state... [id=/aws/route53/staging.document-transfer.cfa.codes]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.microservice.module.service.aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/ecs/illinois-getchildcare/staging/document-transfer]
module.microservice.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-57H7JP-Forwarder-WUhPlW2NzMXr]
module.microservice.module.worker.aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/ecs/illinois-getchildcare/staging/doc-transfer-worker]
module.microservice.aws_cloudwatch_log_subscription_filter.datadog["doc-transfer-worker"]: Refreshing state... [id=cwlsf-2329394860]
module.microservice.aws_cloudwatch_log_subscription_filter.datadog["document-transfer"]: Refreshing state... [id=cwlsf-795611691]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02414c145b73a1bf2]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0506da06c23d3d9fe]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09c173bedb5ad4f50]
module.backend.aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_kms_key.backend: Refreshing state... [id=e12d42f7-5c01-4df2-8f70-8647f8e51d7e]
module.backend.aws_s3_bucket_logging.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_versioning.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_policy.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_lifecycle_configuration.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.vpc.aws_vpc_peering_connection.peer["aptible"]: Refreshing state... [id=pcx-0abf9e62533f46ca6]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02d9a8f3d11eef94a]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0189f0a7ed9c8b1c0]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07da01fd14c162f79]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08ef5814b92528122]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f986d198dd3b9e9d]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06a12308bde60f4c3]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03214fcd109cf3286]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ebea172f63ea7b36]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d07fbe3b003de612]
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8|terraform-20240826174250995600000003]
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h|terraform-20240807163341709200000003]
module.microservice.module.service.module.ecr["this"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0c4c542a315b431d2]
module.backend.aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_kms_alias.backend: Refreshing state... [id=alias/illinois-getchildcare/staging/backend]
module.backend.aws_dynamodb_table.tfstate_lock: Refreshing state... [id=staging.tfstate]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02709b47cad88a398]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08ef5814b925281221080289494]
module.vpc.module.endpoints.aws_security_group.this[0]: Refreshing state... [id=sg-069644483204bfc34]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-089e988da8648dca5]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04a5bc60ca5294ada]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0671e05dfe5d637b6]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07ff470ee8fb30a9c]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0744247f7fe9939f3]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01b22b1c9cb36ddbf]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.microservice.module.service.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-execution]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.microservice.data.aws_subnets.public: Reading...
module.microservice.data.aws_subnets.private: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.vpc.module.endpoints.aws_security_group_rule.this["ingress_https"]: Refreshing state... [id=sgrule-4172651141]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.logging.module.s3.aws_s3_bucket_lifecycle_configuration.main[0]: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-05cc1353d14664da7]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2201565842]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c71017a2af6cf86a]
module.bastion.module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d024041e938721e6]
module.microservice.module.service.data.aws_vpc.current: Reading...
module.microservice.module.worker.data.aws_vpc.current: Reading...
module.microservice.data.aws_subnets.private: Read complete after 0s [id=us-east-1]
module.vpc.aws_route.peer["aptible-rtb-0d07fbe3b003de612"]: Refreshing state... [id=r-rtb-0d07fbe3b003de612368033544]
module.bastion.random_shuffle.subnet: Refreshing state... [id=-]
module.microservice.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::891377151751:policy/vpc-flow-log-to-cloudwatch-20240605160034315600000001]
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Reading...
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Reading...
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Reading...
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d07fbe3b003de6121080289494]
module.microservice.module.service.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:targetgroup/il-gcc-staging-doc-trans-app/fad70920cdce164a]
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Read complete after 0s [id=subnet-0189f0a7ed9c8b1c0]
module.microservice.module.worker.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-doc-transfer-worker-execution]
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Read complete after 0s [id=subnet-07da01fd14c162f79]
module.microservice.module.service.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-0771f8e6767f397d5]
module.microservice.module.service.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06ecd1480c288ef2b]
module.microservice.module.service.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a66151b2382a2108]
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Read complete after 0s [id=subnet-02d9a8f3d11eef94a]
module.microservice.module.worker.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-01e4acea900d38f64]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-061adafc3727e46a2]
module.microservice.module.database.module.database.aws_security_group.this[0]: Refreshing state... [id=sg-0ab438c6ebcfe626e]
module.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002-20240605160034869200000003]
module.bastion.module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4151066003]
module.bastion.aws_instance.this: Refreshing state... [id=i-03c8d3f0af8dfd73f]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.microservice.module.service.data.aws_vpc.current: Read complete after 0s [id=vpc-0c4c542a315b431d2]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.microservice.module.worker.data.aws_vpc.current: Read complete after 1s [id=vpc-0c4c542a315b431d2]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 1s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 1s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 1s [id=2644592029]
module.microservice.module.database.module.database.aws_db_subnet_group.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1770175940]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 1s [id=1808222790]
module.microservice.module.worker.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2419688183]
module.microservice.module.service.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:loadbalancer/app/il-gcc-staging-doc-trans/2cb48b79633f6298]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 1s [id=874300523]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1269108624]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1670266217]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1972381386]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-40105728]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3831811513]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-4065028013]
module.microservice.module.database.module.database.aws_security_group_rule.this["ingress"]: Refreshing state... [id=sgrule-931016090]
module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-4192439624]
module.microservice.module.worker.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1891798500]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.api"]: Refreshing state... [id=vpce-0664fdd4999c62b98]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-contacts"]: Refreshing state... [id=vpce-0e4802fab0b2f69a8]
module.vpc.module.endpoints.aws_vpc_endpoint.this["s3"]: Refreshing state... [id=vpce-06fe221fedf7a8bf2]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2messages"]: Refreshing state... [id=vpce-01cd78c1ead4518ae]
module.vpc.module.endpoints.aws_vpc_endpoint.this["guardduty-data"]: Refreshing state... [id=vpce-0e4febb651c64bbf7]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssmmessages"]: Refreshing state... [id=vpce-038d55d2906b26bf0]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-incidents"]: Refreshing state... [id=vpce-07227d23093c910c6]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2"]: Refreshing state... [id=vpce-09dd677477a50e117]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm"]: Refreshing state... [id=vpce-0013a4b0521c3e0eb]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.dkr"]: Refreshing state... [id=vpce-0093f9b18e02d2a5f]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/73646a3eca8caaac]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/470d149962ca870a]
module.microservice.module.service.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z02064831UC6N7D03DSNG_staging.document-transfer.cfa.codes_A]
module.microservice.module.database.module.database.aws_rds_cluster.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.database.module.database.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-one]
module.microservice.module.database.module.database.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-25551131-8b26-4ab3-af6c-216812369c2b-3RXwjx]
module.microservice.module.worker.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-doc-transfer-worker-secrets-access-20240909164643976400000003]
module.microservice.module.service.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-secrets-access-20240624154936964800000002]
module.microservice.module.database.module.database.aws_rds_cluster_instance.this["two"]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-two]
module.microservice.module.worker.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-doc-transfer-worker/illinois-getchildcare-staging-doc-transfer-worker]
module.microservice.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-document-transfer/illinois-getchildcare-staging-document-transfer]
module.microservice.module.worker.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.microservice.module.worker.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.microservice.module.service.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.microservice.module.service.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.bastion.aws_instance.this must be replaced
+/- resource "aws_instance" "this" {
      ~ ami                                  = "ami-08b5b3a93ed654d19" -> "ami-00a929b66ed6e0de6" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:891377151751:instance/i-03c8d3f0af8dfd73f" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-03c8d3f0af8dfd73f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0b4bfad87e0ef1edc" -> (known after apply)
      ~ private_dns                          = "ip-10-0-22-95.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.22.95" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name"    = "illinois-getchildcare-staging-bastion"
            "service" = "bastion"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (12 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ cpu_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      ~ ebs_block_device {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ enclave_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ ephemeral_block_device {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ instance_market_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ maintenance_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ metadata_options {
          ~ http_put_response_hop_limit = 2 -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_interface {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ private_dns_name_options {
          + ami                                  = (known after apply)
          + arn                                  = (known after apply)
          + associate_public_ip_address          = (known after apply)
          + availability_zone                    = (known after apply)
          + cpu_core_count                       = (known after apply)
          + cpu_threads_per_core                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + enable_primary_ipv6                  = (known after apply)
          + get_password_data                    = (known after apply)
          + hibernation                          = (known after apply)
          + host_id                              = (known after apply)
          + host_resource_group_arn              = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + id                                   = (known after apply)
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_lifecycle                   = (known after apply)
          + instance_state                       = (known after apply)
          + instance_type                        = (known after apply)
          + ipv6_address_count                   = (known after apply)
          + ipv6_addresses                       = (known after apply)
          + key_name                             = (known after apply)
          + monitoring                           = (known after apply)
          + outpost_arn                          = (known after apply)
          + password_data                        = (known after apply)
          + placement_group                      = (known after apply)
          + placement_partition_number           = (known after apply)
          + primary_network_interface_id         = (known after apply)
          + private_dns                          = (known after apply)
          + private_ip                           = (known after apply)
          + public_dns                           = (known after apply)
          + public_ip                            = (known after apply)
          + secondary_private_ips                = (known after apply)
          + security_groups                      = (known after apply)
          + source_dest_check                    = (known after apply)
          + spot_instance_request_id             = (known after apply)
          + subnet_id                            = (known after apply)
          + tags                                 = (known after apply)
          + tags_all                             = (known after apply)
          + tenancy                              = (known after apply)
          + user_data                            = (known after apply)
          + user_data_base64                     = (known after apply)
          + user_data_replace_on_change          = (known after apply)
          + volume_tags                          = (known after apply)
          + vpc_security_group_ids               = (known after apply)
        } -> (known after apply)

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-008a2e3956717fd62" -> (known after apply)
          ~ volume_type           = "gp3" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.hosted_zones.aws_cloudwatch_log_resource_policy.this["document_transfer"] will be destroyed
  # (because aws_cloudwatch_log_resource_policy.this is not in configuration)
  - resource "aws_cloudwatch_log_resource_policy" "this" {
      - id              = "illinois-getchildcare-staging-route53-staging.document-transfer.cfa.codes" -> null
      - policy_document = jsonencode(
            {
              - Id        = "Route53 Logging Policy"
              - Statement = [
                  - {
                      - Action    = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "route53.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes",
                          - "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes:*",
                        ]
                      - Sid       = "Allow Route53 to write logs to CloudWatch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_name     = "illinois-getchildcare-staging-route53-staging.document-transfer.cfa.codes" -> null
    }

  # module.hosted_zones.aws_route53_query_log.this["document_transfer"] will be destroyed
  # (because aws_route53_query_log.this is not in configuration)
  - resource "aws_route53_query_log" "this" {
      - arn                      = "arn:aws:route53:::queryloggingconfig/fe638ff4-a024-4c13-9df3-3ea796f5fd31" -> null
      - cloudwatch_log_group_arn = "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes" -> null
      - id                       = "fe638ff4-a024-4c13-9df3-3ea796f5fd31" -> null
      - zone_id                  = "Z02064831UC6N7D03DSNG" -> null
    }

  # module.hosted_zones.aws_route53_zone.this["document_transfer"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Hosted zone for the Document Transfer service."
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "staging.document-transfer.cfa.codes"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "application" = "illinois-getchildcare-staging"
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "tofu"        = "true"
        }
      + zone_id             = (known after apply)
    }

  # module.logging.aws_cloudwatch_log_group.logs["document-transfer-dns"] will be destroyed
  # (because key ["document-transfer-dns"] is not in for_each map)
  - resource "aws_cloudwatch_log_group" "logs" {
      - arn               = "arn:aws:logs:us-east-1:891377151751:log-group:/aws/route53/staging.document-transfer.cfa.codes" -> null
      - id                = "/aws/route53/staging.document-transfer.cfa.codes" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:891377151751:key/c9834240-1993-4623-9c60-ab21bd6a7269" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/route53/staging.document-transfer.cfa.codes" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "domain"  = "staging.document-transfer.cfa.codes"
          - "service" = "document-transfer"
          - "use"     = "logging"
        } -> null
      - tags_all          = {
          - "application" = "illinois-getchildcare-staging"
          - "domain"      = "staging.document-transfer.cfa.codes"
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "service"     = "document-transfer"
          - "tofu"        = "true"
          - "use"         = "logging"
        } -> null
    }

  # module.hosted_zones.module.hosted_zones.aws_route53_zone.this["document_transfer"] will be destroyed
  # (because aws_route53_zone.this is not in configuration)
  - resource "aws_route53_zone" "this" {
      - arn                 = "arn:aws:route53:::hostedzone/Z02064831UC6N7D03DSNG" -> null
      - comment             = "Hosted zone for the Document Transfer service." -> null
      - force_destroy       = false -> null
      - id                  = "Z02064831UC6N7D03DSNG" -> null
      - name                = "staging.document-transfer.cfa.codes" -> null
      - name_servers        = [
          - "ns-1087.awsdns-07.org",
          - "ns-143.awsdns-17.com",
          - "ns-1840.awsdns-38.co.uk",
          - "ns-655.awsdns-17.net",
        ] -> null
      - primary_name_server = "ns-1840.awsdns-38.co.uk" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "application" = "illinois-getchildcare-staging"
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "tofu"        = "true"
        } -> null
      - zone_id             = "Z02064831UC6N7D03DSNG" -> null
    }

  # module.microservice.module.service.aws_kms_key.fargate will be updated in-place
  ~ resource "aws_kms_key" "fargate" {
        id                                 = "d654dd34-e8d2-4218-ab18-512c5c6bcee4"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = [
                            "kms:Decrypt",
                            "kms:Encrypt",
                            "kms:GenerateDataKey",
                            "kms:ReEncrypt*",
                        ]
                        Condition = {
                            StringEquals = {
                                "kms:CallerAccount"                 = "891377151751"
                                "kms:EncryptionContext:aws:ecr:arn" = "arn:aws:ecr:us-east-1:891377151751:repository/illinois-getchildcare-staging-document-transfer"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                        Sid       = "Allow ECR to encrypt container images"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Fargate containers to encrypt objects"
                    },
                ]
                # (2 unchanged attributes hidden)
            }
        )
        tags                               = {
            "service" = "document-transfer"
        }
        # (12 unchanged attributes hidden)
    }

  # module.microservice.module.worker.aws_kms_key.fargate will be updated in-place
  ~ resource "aws_kms_key" "fargate" {
        id                                 = "2c1ab5d7-6ad2-45d3-854f-52b71401de48"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action    = [
                            "kms:Decrypt",
                            "kms:Encrypt",
                            "kms:GenerateDataKey",
                            "kms:ReEncrypt*",
                        ]
                        Condition = {
                            StringEquals = {
                                "kms:CallerAccount"                 = "891377151751"
                                "kms:EncryptionContext:aws:ecr:arn" = "arn:aws:ecr:us-east-1:891377151751:repository/illinois-getchildcare-staging-doc-transfer-worker"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                        Sid       = "Allow ECR to encrypt container images"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Fargate containers to encrypt objects"
                    },
                ]
                # (2 unchanged attributes hidden)
            }
        )
        tags                               = {
            "service" = "document-transfer"
        }
        # (12 unchanged attributes hidden)
    }

  # module.microservice.module.service.module.alb["this"].aws_lb_listener.this["https"] will be updated in-place
  ~ resource "aws_lb_listener" "this" {
        id                                   = "arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/73646a3eca8caaac"
      ~ ssl_policy                           = "ELBSecurityPolicy-TLS13-1-2-2021-06" -> "ELBSecurityPolicy-TLS-1-2-2017-01"
        tags                                 = {
            "service"               = "document-transfer"
            "terraform-aws-modules" = "alb"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.microservice.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-document-transfer/illinois-getchildcare-staging-document-transfer"
        name                               = "illinois-getchildcare-staging-document-transfer"
        tags                               = {
            "service" = "document-transfer"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-document-transfer:57" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.microservice.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-doc-transfer-worker/illinois-getchildcare-staging-doc-transfer-worker"
        name                               = "illinois-getchildcare-staging-doc-transfer-worker"
        tags                               = {
            "service" = "document-transfer"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-doc-transfer-worker:2" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.microservice.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-document-transfer:57" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-document-transfer" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints            = []
                    name                   = "illinois-getchildcare-staging-document-transfer"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 3000
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - readonlyRootFilesystem = true
                  - systemControls         = []
                  - volumesFrom            = []
                    # (9 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints            = []
                    name                   = "otel-collector"
                  - portMappings           = []
                  - readonlyRootFilesystem = true
                  - systemControls         = []
                  - volumesFrom            = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "illinois-getchildcare-staging-document-transfer" -> (known after apply)
      ~ revision                 = 57 -> (known after apply)
        tags                     = {
            "service" = "document-transfer"
        }
        # (10 unchanged attributes hidden)
    }

  # module.microservice.module.worker.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-doc-transfer-worker:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-doc-transfer-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints            = []
                    name                   = "illinois-getchildcare-staging-doc-transfer-worker"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - readonlyRootFilesystem = true
                  - systemControls         = []
                  - volumesFrom            = []
                    # (10 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints            = []
                    name                   = "otel-collector"
                  - portMappings           = []
                  - readonlyRootFilesystem = true
                  - systemControls         = []
                  - volumesFrom            = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "illinois-getchildcare-staging-doc-transfer-worker" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "service" = "document-transfer"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 7 to destroy.

Changes to Outputs:
  ~ bastion_instance_id           = "i-03c8d3f0af8dfd73f" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```